api/test/xmlTextFile.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:sap-com:document:sap:rfc:functions">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:ZMPPP_COMP_DTL_WEBSERVICE>
         <T_ALORT>
            <item>
               <ALORT>M101</ALORT>
            </item>
         </T_ALORT>
         <T_MATNR>
         </T_MATNR>
         <T_WERKS>
            <item>
               <WERKS>7002</WERKS>
            </item>
         </T_WERKS>
         <UDATE_FROM>01.08.2019</UDATE_FROM>
         <UDATE_TO></UDATE_TO>
         <UTIME_FROM></UTIME_FROM>
         <UTIME_TO></UTIME_TO>
         <ZCOMP_DTL>
            <item>
               <ZIDNRK></ZIDNRK>
               <ZMAKTX></ZMAKTX>
               <ZMEINS></ZMEINS>
               <ZANDAT></ZANDAT>
               <ZAEDAT></ZAEDAT>
               <ZMATKL></ZMATKL>
               <ZMATNR></ZMATNR>
               <ZMAKTX1></ZMAKTX1>
               <ZMEINS1></ZMEINS1>
               <ZANDAT1></ZANDAT1>
               <ZAEDAT1></ZAEDAT1>
               <ZMENGE></ZMENGE>
               <ZLGFSB></ZLGFSB>
               <ZSTATUS></ZSTATUS>
            </item>
         </ZCOMP_DTL>
      </urn:ZMPPP_COMP_DTL_WEBSERVICE>
   </soapenv:Body>
</soapenv:Envelope>
